{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_4", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 45, "batch_input_shape": [null, 61], "W_regularizer": null, "dropout": 0.0, "output_dim": 128, "input_length": 61}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_4", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 38}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}